IDEA Open Model
CheckResAnchor.LoadCaseId Property
Compatible with IDEA StatiCa v 10.1
 Id of Load Case
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public int LoadCaseId { get; set; }
Public Property LoadCaseId As Integer
	Get
	Set
public:
property int LoadCaseId {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
CheckResAnchor Class
IdeaRS.OpenModel.Connection Namespace